#+title: Emacs Notes
#+date: <2021-01-04 Mon>
#+lastmod: 2021-10-27 08:35:20
#+author: Nasser Alkmim
#+email: nasser.alkmim@gmail.com
#+toc: t
#+draft: t
#+tags[]: emacs tools 
*** Check texlive =texmf-local= folder

#+begin_src shell
kpsewhich --var-value TEXMFLOCAL
#+end_src

#+RESULTS:
: /usr/local/share/texmf


Tex Live has its own texmf, which is the =texmf-dist=.
The "dist" contains the packages of the distribution.

#+begin_src shell
cd /usr/share/texlive/ 
ls -la | grep texmf
#+end_src

#+RESULTS:
: drwxr-xr-x  21 root root    4096 May  7 16:40 texmf-dist

*** DONE Emacs jupyter
<2021-06-23 Wed> the package exec-path-from-shell add the appropriate paths to emacs =exec-path= variable so it can find jupyter in the user binaries folder.


In the terminal:

#+begin_src shell
which jupyter
#+end_src

is installed in the user binaries folder =/home/nasser/.local/bin=

Which is not inside =exec-path= variable.
#+begin_src emacs-lisp
(print exec-path)
#+end_src

#+RESULTS:
| /usr/local/sbin/ | /usr/local/bin/ | /usr/sbin/ | /usr/bin/ | /sbin/ | /bin/ | /usr/games/ | /usr/local/games/ | /mnt/c/SIMULIA/Commands/ | /mnt/c/Program Files/Microsoft MPI/Bin/ | /mnt/c/Program Files/ImageMagick-7.0.11-Q16-HDRI/ | /mnt/c/WINDOWS/system32/ | /mnt/c/WINDOWS/ | /mnt/c/WINDOWS/System32/Wbem/ | /mnt/c/WINDOWS/System32/WindowsPowerShell/v1.0/ | /mnt/c/Program Files/PuTTY/ | /mnt/c/WINDOWS/System32/OpenSSH/ | /mnt/c/ProgramData/chocolatey/bin/ | /mnt/c/Program Files/PowerShell/7/ | /mnt/c/Users/c8441205/AppData/Local/SumatraPDF/ | /mnt/c/Program Files/dotnet/ | /mnt/c/Program Files/ParaView 5.9.1-Windows-Python3.8-msvc2017-64bit/bin/ | /mnt/c/Users/c8441205/AppData/Local/Microsoft/WindowsApps/ | /usr/local/libexec/emacs/28.0.50/x86_64-pc-linux-gnu/ |


Added with =(add-to-list 'exec-path "/home/nasser/.local/bin")=.

#+begin_src emacs-lisp
(add-to-list 'exec-path "~/.local/bin")
(print exec-path)
#+end_src

#+RESULTS:
| ~/.local/bin | /usr/local/sbin | /usr/local/bin | /usr/sbin | /usr/bin | /sbin | /bin | /usr/games | /usr/local/games | /mnt/c/SIMULIA/Commands | /mnt/c/Program Files/Microsoft MPI/Bin/ | /mnt/c/Program Files/ImageMagick-7.0.11-Q16-HDRI | /mnt/c/WINDOWS/system32 | /mnt/c/WINDOWS | /mnt/c/WINDOWS/System32/Wbem | /mnt/c/WINDOWS/System32/WindowsPowerShell/v1.0/ | /mnt/c/Program Files/PuTTY/ | /mnt/c/WINDOWS/System32/OpenSSH/ | /mnt/c/ProgramData/chocolatey/bin | /mnt/c/Program Files/PowerShell/7/ | /mnt/c/Users/c8441205/AppData/Local/SumatraPDF | /mnt/c/Program Files/dotnet/ | /mnt/c/Program Files/ParaView 5.9.1-Windows-Python3.8-msvc2017-64bit/bin | /mnt/c/Users/c8441205/AppData/Local/Microsoft/WindowsApps | /usr/local/libexec/emacs/28.0.50/x86_64-pc-linux-gnu |

#+begin_src shell
jupyter --version
#+end_src

#+RESULTS:

I also was getting error for emacs-jupyter not finding python (=apply: Searching for program: No such file or directory, python=).
Emacs-jupyter was not finding python, even though I could call =python3= in the wsl terminal.
It seems that emacs-jupyter (=jupyter-locate-python=) looks for python only at =jupyter --path=.

More specifically emacs-jupyter looks at =/usr/local/bin/= and my python3 was installed =which python3= at =/usr/bin/=.
So I had to create a symbolic link =sudo ln -s /usr/bin/python3 /usr/local/bin/python=.
Then it worked.

*** DONE Treemacs =visit-node-in-external-application=
Update: <2021-05-08 Sat> Using bash from wsl. Set up a desktop application with =/usr/bin/sh= and set it as default for xdg-open.


This is a reason for me to keep standard emacs on windows.

When I call this function in a =.sh= file it opens as a text in another emacs instance.
However I want it to just run, currently I have to call =treemacs-run-shell-command-for-current-node= and manually type the filename =./script.sh=.

For instance, in windows I just go to =deploy.sh= on treemacs and hit =o x= to run the script.

Can use =wsl-open= to fix that.
[[https://github.com/4U6U57/wsl-open][GitHub - 4U6U57/wsl-open: Open files with xdg-open on Bash for Windows in Win...]]
wsl-open will open script with git bash from windows git installation.


Change the default application that runs shell scripts (application/x-shellscript) for the =wsl-open=.
Use =xdg-mime query filetype file.sh= to discover the filetype.
And use =xdg-mime query default <new filetype>= to discover which application is the default for it.
Currently is =emacs.desktop=, which opens the shell script in another emacs instance.
I created a =wsl-open.desktop= inside =~/.local/share/applications= with 

#+begin_example
[Desktop Entry]
Name=wsl-open
Exec=/usr/local/bin/wsl-open
Type=Application
#+end_example

and set as default with

#+begin_src sh
xdg-mime query default application/x-sh
xdg-mime default bash.desktop application/x-sh
xdg-mime query default application/x-sh
#+end_src

#+RESULTS:
: bash.desktop

Now when I open a shell script with xdg-open (=x o= in treemacs) it runs the script just like in windows.

*** DONE vterm $PATH variable and emacs =exec-path=
<2021-06-23 Wed> It is necessary the default flag =-i= for interactive.

vterm $PATH does not reproduce the same (exec-path) as emacs,

#+begin_src emacs-lisp
(exec-path)
#+end_src

#+RESULTS:
| ~/.local/bin | /usr/local/sbin | /usr/local/bin | /usr/sbin | /usr/bin | /sbin | /bin | /usr/games | /usr/local/games | /mnt/c/SIMULIA/Commands | /mnt/c/Program Files/Microsoft MPI/Bin/ | /mnt/c/Program Files/ImageMagick-7.0.11-Q16-HDRI | /mnt/c/WINDOWS/system32 | /mnt/c/WINDOWS | /mnt/c/WINDOWS/System32/Wbem | /mnt/c/WINDOWS/System32/WindowsPowerShell/v1.0/ | /mnt/c/Program Files/PuTTY/ | /mnt/c/WINDOWS/System32/OpenSSH/ | /mnt/c/ProgramData/chocolatey/bin | /mnt/c/Program Files/PowerShell/7/ | /mnt/c/Users/c8441205/AppData/Local/SumatraPDF | /mnt/c/Program Files/dotnet/ | /mnt/c/Program Files/ParaView 5.9.1-Windows-Python3.8-msvc2017-64bit/bin | /mnt/c/Users/c8441205/AppData/Local/Microsoft/WindowsApps | /usr/local/libexec/emacs/28.0.50/x86_64-pc-linux-gnu |

In vterm, with =echo $PATH= I get,

#+begin_example
/usr/local/go/bin:/home/nasser/miniconda3/condabin:/usr/local/sbin:/usr/local/bin:/usr/sbin:/usoft
MPI/Bin/:/mnt/c/Program Files/ImageMagick-7.0.11-Q16-HDRI:/mnt/c/WINDOWS/system32:/mnt/c/ram
Files/PuTTY/:/mnt/c/WINDOWS/System32/OpenSSH/:/mnt/c/ProgramData/chocolatey/bin:/mnt/c/Pronet/:/mnt/c/Program
Files/ParaView
5.9.1-Windows-Python3.8-msvc2017-64bit/bin:/mnt/c/Users/c84
#+end_example

If I activate the package =exec-path-from-shell=, I get:

#+begin_src 
/usr/local/go/bin:/home/nasser/miniconda3/condabin:/home/nasser/.local/bin:/usr/local/go/bin:/home/nasser/miniconda3/condabin:/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games:/usr/local/games:/mnt/c/SIMULIA/Commands:/mnt/c/Program
Files/Microsoft MPI/Bin/:/mnt/c/Program
Files/ImageMagick-7.0.11-Q16-HDRI:/mnt/c/WINDOWS/system32:/mnt/c/WINDOWS:/mnt/c/WINDOWS/System32/Wbem:/mnt/c/WINDOWS/System32/WindowsPowerShell/v1.0/:/mnt/c/Program
Files/PuTTY/:/mnt/c/WINDOWS/System32/OpenSSH/:/mnt/c/ProgramData/chocolatey/bin:/mnt/c/Program
Files/PowerShell/7/:/mnt/c/Users/c8441205/AppData/Local/SumatraPDF:/mnt/c/Program
Files/dotnet/:/mnt/c/Program Files/ParaView
5.9.1-Windows-Python3.8-msvc2017-64bit/bin:/mnt/c/Users/c8441205/AppData/Local/Microsoft/WindowsApps:/snap/bin:/home/nasser/go/bin:/home/nasser/go/bin
#+end_src

Which includes =~/.local/bin=.



** Make

#+begin_src shell
neofetch
#+end_src

#+RESULTS:
#+begin_example
[?25l[?7l[0m[31m[1m            .-/+oossssoo+/-.
        `:+ssssssssssssssssss+:`
      -+ssssssssssssssssssyyssss+-
    .ossssssssssssssssss[37m[0m[1mdMMMNy[0m[31m[1msssso.
   /sssssssssss[37m[0m[1mhdmmNNmmyNMMMMh[0m[31m[1mssssss/
  +sssssssss[37m[0m[1mhm[0m[31m[1myd[37m[0m[1mMMMMMMMNddddy[0m[31m[1mssssssss+
 /ssssssss[37m[0m[1mhNMMM[0m[31m[1myh[37m[0m[1mhyyyyhmNMMMNh[0m[31m[1mssssssss/
.ssssssss[37m[0m[1mdMMMNh[0m[31m[1mssssssssss[37m[0m[1mhNMMMd[0m[31m[1mssssssss.
+ssss[37m[0m[1mhhhyNMMNy[0m[31m[1mssssssssssss[37m[0m[1myNMMMy[0m[31m[1msssssss+
oss[37m[0m[1myNMMMNyMMh[0m[31m[1mssssssssssssss[37m[0m[1mhmmmh[0m[31m[1mssssssso
oss[37m[0m[1myNMMMNyMMh[0m[31m[1msssssssssssssshmmmh[0m[31m[1mssssssso
+ssss[37m[0m[1mhhhyNMMNy[0m[31m[1mssssssssssss[37m[0m[1myNMMMy[0m[31m[1msssssss+
.ssssssss[37m[0m[1mdMMMNh[0m[31m[1mssssssssss[37m[0m[1mhNMMMd[0m[31m[1mssssssss.
 /ssssssss[37m[0m[1mhNMMM[0m[31m[1myh[37m[0m[1mhyyyyhdNMMMNh[0m[31m[1mssssssss/
  +sssssssss[37m[0m[1mdm[0m[31m[1myd[37m[0m[1mMMMMMMMMddddy[0m[31m[1mssssssss+
   /sssssssssss[37m[0m[1mhdmNNNNmyNMMMMh[0m[31m[1mssssss/
    .ossssssssssssssssss[37m[0m[1mdMMMNy[0m[31m[1msssso.
      -+sssssssssssssssss[37m[0m[1myyy[0m[31m[1mssss+-
        `:+ssssssssssssssssss+:`
            .-/+oossssoo+/-.[0m
[20A[9999999D[43C[0m[1m[31m[1mnasser[0m@[31m[1mlt135-c842[0m 
[43C[0m-----------------[0m 
[43C[0m[31m[1mOS[0m[0m:[0m Ubuntu 20.04.2 LTS on Windows 10 x86_64[0m 
[43C[0m[31m[1mKernel[0m[0m:[0m 5.4.72-microsoft-standard-WSL2[0m 
[43C[0m[31m[1mUptime[0m[0m:[0m 23 mins[0m 
[43C[0m[31m[1mPackages[0m[0m:[0m 1675 (dpkg)[0m 
[43C[0m[31m[1mShell[0m[0m:[0m bash 5.0.17[0m 
[43C[0m[31m[1mResolution[0m[0m:[0m 4096x1440[0m 
[43C[0m[31m[1mTheme[0m[0m:[0m Adwaita [GTK3][0m 
[43C[0m[31m[1mIcons[0m[0m:[0m Adwaita [GTK3][0m 
[43C[0m[31m[1mTerminal[0m[0m:[0m emacs[0m 
[43C[0m[31m[1mCPU[0m[0m:[0m AMD Ryzen 5 PRO 4650U with Radeon Graphics (10) @ 2.095GHz[0m 
[43C[0m[31m[1mMemory[0m[0m:[0m 298MiB / 11978MiB[0m 

[43C[30m[40m   [31m[41m   [32m[42m   [33m[43m   [34m[44m   [35m[45m   [36m[46m   [37m[47m   [m
[?25h[?7h
#+end_example

=make -j <#processors>= I have currently 12 processors cores (=neofetch=).
Use =sudo= if need extra permissions.

=make clean= removes files produced by the build process in the current configuration.
After =make clean= can rebuild with =make= and make sure that all built products are from coherent sources.


=make distclean= removes Makefiles and other generated files.
Returns to the "freshly unpacked source distribution"

*** Update remote (github repository)
#+begin_src shell
cd ~/emacs
git remote update
#+end_src

#+RESULTS:
: Fetching origin

*** Check status with remote

#+begin_src shell
cd ~/emacs
git status -uno
#+end_src

#+RESULTS:
: On branch master
: Your branch is behind 'origin/master' by 19 commits, and can be fast-forwarded.
:   (use "git pull" to update your local branch)
: 
: nothing to commit (use -u to show untracked files)

*** Check commits from master branch

#+begin_src shell
cd ~/emacs
git show-branch *master
#+end_src

#+RESULTS:
#+begin_example
,* [master] Fix filling of overlong first lines in Python doc strings
 ! [refs/remotes/origin/master] Improve previous frames.texi change
--
 + [refs/remotes/origin/master] Improve previous frames.texi change
 + [refs/remotes/origin/master^] Specify which Gsetting font names are used in the manual
 + [refs/remotes/origin/master~2] Fix previous admin/emake change
 + [refs/remotes/origin/master~3] Adjust admin/emake filters
 + [refs/remotes/origin/master~4] Continue checking the same line when hitting SPC in ispell
 + [refs/remotes/origin/master~5] Fix looking-at-p example in shortdoc.el
 + [refs/remotes/origin/master~6] Mention the -e switch in an ange-ftp doc string
 + [refs/remotes/origin/master~7] Fix nnimap lexical conversion problem
 + [refs/remotes/origin/master~8] * lisp/emacs-lisp/byte-opt.el (byte-compile-inline-expand): Silence warnings
 + [refs/remotes/origin/master~9] * lisp/progmodes/sql.el: Turn `sql-*-statement-starters' to defvars.
 + [refs/remotes/origin/master~10] ; * src/character.c (lisp_string_width): Another defensive fix.
 + [refs/remotes/origin/master~11] * src/character.c (lisp_string_width): Fix a typo in recent change.
 + [refs/remotes/origin/master~12] Fix resolution of symlinks during dumping
 + [refs/remotes/origin/master~13] ; * etc/tutorials/TUTORIAL.sv: Fix typo in last change.
 + [refs/remotes/origin/master~14] * src/character.c (lisp_string_width): Fix last change.
 + [refs/remotes/origin/master~15] Fix lexing of numbers with trailing decimal point and exponent
 + [refs/remotes/origin/master~16] Don't propagate lexical variables into inlined functions
 + [refs/remotes/origin/master~17] * src/character.c (lisp_string_width): Add missing type checks.
 + [refs/remotes/origin/master~18] A better fix for 'string-width'
,*+ [master] Fix filling of overlong first lines in Python doc strings
#+end_example

** Update emacs

=git pull= to download updates from remote.

=sudo make -j12= to build and =sudo make install=

To check build date.

#+begin_src emacs-lisp
(emacs-version)
#+end_src

#+RESULTS:
: GNU Emacs 28.0.50 (build 3, x86_64-pc-linux-gnu, GTK+ Version 2.24.32, cairo version 1.16.0)
:  of 2021-06-04



** What does "build" a package in straight mean?
For straight, _build_ means _creating a symbolic links_ between the "packages directory" and the local package repository directory.

Straight also byte-compile the package files and generate autoloads for them.

For instance, the local repo is in =~/.emacs.d/straight/repos/= and we can check the package version.

#+begin_src shell
cd ~/.emacs.d/straight/repos/
ls -la | grep use-package
cd use-package
git describe
#+end_src

#+RESULTS:
: drwxr-xr-x   4 nasser nasser  4096 May 28 09:10 use-package
: 2.4.1-14-ga7422fb

Then straight creates a "build" folder with symbolic links to the repository files,

#+begin_src shell
cd ~/.emacs.d/straight/build/use-package
ls -Gg | sed -re 's/^[^ ]* //' | grep '\->'
#+end_src

#+RESULTS:
: 1    72 Jul 15 09:12 use-package-bind-key.el -> /home/nasser/.emacs.d/straight/repos/use-package/use-package-bind-key.el
: 1    68 Jul 15 09:12 use-package-core.el -> /home/nasser/.emacs.d/straight/repos/use-package/use-package-core.el
: 1    71 Jul 15 09:12 use-package-delight.el -> /home/nasser/.emacs.d/straight/repos/use-package/use-package-delight.el
: 1    72 Jul 15 09:12 use-package-diminish.el -> /home/nasser/.emacs.d/straight/repos/use-package/use-package-diminish.el
: 1    70 Jul 15 09:12 use-package-ensure.el -> /home/nasser/.emacs.d/straight/repos/use-package/use-package-ensure.el
: 1    68 Jul 15 09:12 use-package-jump.el -> /home/nasser/.emacs.d/straight/repos/use-package/use-package-jump.el
: 1    68 Jul 15 09:12 use-package-lint.el -> /home/nasser/.emacs.d/straight/repos/use-package/use-package-lint.el
: 1    63 Jul 15 09:12 use-package.el -> /home/nasser/.emacs.d/straight/repos/use-package/use-package.el
: 1    65 Jul 15 09:12 use-package.texi -> /home/nasser/.emacs.d/straight/repos/use-package/use-package.texi

Then straight also byte-compile those files, 

#+begin_src shell
cd ~/.emacs.d/straight/build/use-package
ls | grep .elc
#+end_src

#+RESULTS:
: use-package-bind-key.elc
: use-package-core.elc
: use-package-delight.elc
: use-package-diminish.elc
: use-package-ensure.elc
: use-package-jump.elc
: use-package-lint.elc
: use-package.elc

Straight also automatically create autoloads,

#+begin_src shell
cd ~/.emacs.d/straight/build/use-package
head -10 use-package-autoloads.el
#+end_src

#+RESULTS:
#+begin_example
;;; use-package-autoloads.el --- automatically extracted autoloads  -*- lexical-binding: t -*-
;;
;;; Code:


;;;### (autoloads nil "use-package-bind-key" "use-package-bind-key.el"
;;;;;;  (0 0 0 0))
;;; Generated autoloads from use-package-bind-key.el

(autoload 'use-package-autoload-keymap "use-package-bind-key" "\
#+end_example

** How does straight "load" a package?

It adds the /package directory/ to the load path and evaluate the autoloads file.

For instance, it adds the "build" folder for this package into the =load-path= so emacs can find the =.el= file.

#+begin_src emacs-lisp
(car load-path)
#+end_src

#+RESULTS:
: /home/nasser/.emacs.d/straight/build/highlight-indent-guides

It does not "require" the package file, it just adds it to the load-path so it can be required.
This is good because when the file is required, the interpreter goes over the file, reads it, and make its definitions available.
Which takes time!

Straight automatically provides autoloads to the package.
This means that you can use use the functions in this autoload file, when you do that, then the packages file is "required".

*** Shell
From the shell,
#+begin_src shell
python -c "import sys; print(sys.path)"
#+end_src

#+RESULTS:
: ['', '/usr/lib/python38.zip', '/usr/lib/python3.8', '/usr/lib/python3.8/lib-dynload', '/home/nasser/.local/lib/python3.8/site-packages', '/mnt/c/Users/c8441205/OneDrive/Academy/Projects/package', '/usr/local/lib/python3.8/dist-packages', '/usr/lib/python3/dist-packages']

We can see the default location pointing to the conda environment.
This because conda default environment is loaded with the shell, configured in the =.bashrc= file.
*** Jupyter default kernel
Using the default jupyter python kernel,

#+begin_src python
import sys
print(sys.path)
#+end_src

#+RESULTS:
: ['/mnt/c/Users/c8441205/OneDrive/nasser-website/content/notes/python-notes', '/usr/lib/python38.zip', '/usr/lib/python3.8', '/usr/lib/python3.8/lib-dynload', '', '/home/nasser/.local/lib/python3.8/site-packages', '/mnt/c/Users/c8441205/OneDrive/Academy/Projects/package', '/usr/local/lib/python3.8/dist-packages', '/usr/lib/python3/dist-packages', '/home/nasser/.local/lib/python3.8/site-packages/IPython/extensions', '/home/nasser/.ipython']

We can see the default =/usr/lib/python3.8/site-packages.=

